In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("../Data/Teams.csv")

In [3]:
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   Kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [4]:
#group by
team=df.groupby("Team")

In [5]:
team.groups

{'Devils': [2, 3], 'Kings': [4, 5, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10]}

In [9]:
# get_group("Group name")
devils=team.get_group("Devils")
devils

   Points  Rank    Team  Year
2     863     2  Devils  2014
3     673     3  Devils  2015

In [10]:
team.get_group("Riders")

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017

In [11]:
rank=df.groupby("Rank")
rank.groups

{1: [0, 6, 7, 10], 2: [1, 2, 8, 11], 3: [3, 4], 4: [5, 9]}

In [12]:
rank1_df=rank.get_group(1)
rank1_df

    Points  Rank    Team  Year
0      876     1  Riders  2014
6      756     1   Kings  2016
7      788     1   Kings  2017
10     804     1  Royals  2015

In [13]:
#get the highest points from rank 1 team
rank1_df["Points"].max()

876

In [14]:
# get average points from rank 1 team
rank1_df["Points"].mean()

806.0

In [15]:
rank1_df["Points"].min()

756

In [16]:
rank1_df["Team"].count()

4

In [17]:
rank1_df.describe()

          Points  Rank         Year
count    4.00000   4.0     4.000000
mean   806.00000   1.0  2015.500000
std     50.75431   0.0     1.290994
min    756.00000   1.0  2014.000000
25%    780.00000   1.0  2014.750000
50%    796.00000   1.0  2015.500000
75%    822.00000   1.0  2016.250000
max    876.00000   1.0  2017.000000

### Group by Task

1. Group by the team and display all teams

In [19]:
team=df.groupby("Team")
for key in team.groups.keys():
    print(team.get_group(key))

   Points  Rank    Team  Year
2     863     2  Devils  2014
3     673     3  Devils  2015
   Points  Rank   Team  Year
4     741     3  Kings  2014
5     812     4  Kings  2015
6     756     1  Kings  2016
7     788     1  Kings  2017
    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017
    Points  Rank    Team  Year
9      701     4  Royals  2014
10     804     1  Royals  2015

In [20]:
team.get_group("Devils")
team.get_group("Riders")
team.get_group("Royals")
team.get_group("Kings")

   Points  Rank    Team  Year
2     863     2  Devils  2014
3     673     3  Devils  2015

2. Print all Riders teams Details

In [21]:
team.get_group("Riders")

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017

3.Print The maximum Points of Year 2014

In [25]:
#3
year=df.groupby("Year")
y_2014=year.get_group(2014)
y_2014["Points"].max()

876

4.Print all rank 1 teams

In [26]:
rank=df.groupby("Rank")
rank.get_group(1)

    Points  Rank    Team  Year
0      876     1  Riders  2014
6      756     1   Kings  2016
7      788     1   Kings  2017
10     804     1  Royals  2015

5. Print Each Teams Highest Points

In [27]:
team=df.groupby("Team")
team["Points"].max()

Team
Devils    863
Kings     812
Riders    876
Royals    804
Name: Points, dtype: int64

6. Print Each Teams average Points

In [28]:
team=df.groupby("Team")
team["Points"].mean()

Team
Devils    768.00
Kings     774.25
Riders    762.25
Royals    752.50
Name: Points, dtype: float64

### Filter the data using condition

In [29]:
#dataframe[condition]
df[df["Year"]==2014]

   Points  Rank    Team  Year
0     876     1  Riders  2014
2     863     2  Devils  2014
4     741     3   Kings  2014
9     701     4  Royals  2014

In [31]:
#multiple condition
#df[(condition 1) &, |, (condition 2)]
df[(df['Year']==2014) & (df["Rank"]==1)]

   Points  Rank    Team  Year
0     876     1  Riders  2014

In [32]:
df[df["Team"]=="Riders"]

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017

In [33]:
df["Team"]=="Riders"

0      True
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9     False
10    False
11     True
Name: Team, dtype: bool

In [37]:
# highest score team and points
df[df["Points"]==df["Points"].max()]

   Points  Rank    Team  Year
0     876     1  Riders  2014

### Sorting

In [39]:
help(df.sort_values)

Help on method sort_values in module pandas.core.frame:

sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last', ignore_index=False, key: Union[Callable[[ForwardRef('Series')], Union[ForwardRef('Series'), ~AnyArrayLike]], NoneType] = None) method of pandas.core.frame.DataFrame instance
    Sort by the values along either axis.

    Parameters
    ----------
            by : str or list of str
                Name or list of names to sort by.

                - if `axis` is 0 or `'index'` then `by` may contain index
                  levels and/or column labels.
                - if `axis` is 1 or `'columns'` then `by` may contain column
                  levels and/or index labels.

                .. versionchanged:: 0.23.0

                   Allow specifying index or column level names.
    axis : {0 or 'index', 1 or 'columns'}, default 0
         Axis to be sorted.
    ascending : bool or list of bool, default True
         Sort ascending vs. descending. Specify list for multiple sort
         orders.  If this is a list of bools, must match the length of
         the by.
    inplace : bool, default False
         If True, perform operation in-place.
    kind : {'quicksort', 'mergesort', 'heapsort'}, default 'quicksort'
         Choice of sorting algorithm. See also ndarray.np.sort for more
         information.  `mergesort` is the only stable algorithm. For
         DataFrames, this option is only applied when sorting on a single
         column or label.
    na_position : {'first', 'last'}, default 'last'
         Puts NaNs at the beginning if `first`; `last` puts NaNs at the
         end.
    ignore_index : bool, default False
         If True, the resulting axis will be labeled 0, 1, â€¦, n - 1.

         .. versionadded:: 1.0.0

    key : callable, optional
        Apply the key function to the values
        before sorting. This is similar to the `key` argument in the
        builtin :meth:`sorted` function, with the notable difference that
        this `key` function should be *vectorized*. It should expect a
        ``Series`` and return a Series with the same shape as the input.
        It will be applied to each column in `by` independently.

        .. versionadded:: 1.1.0

    Returns
    -------
    DataFrame or None
        DataFrame with sorted values if inplace=False, None otherwise.

    See Also
    --------
    DataFrame.sort_index : Sort a DataFrame by the index.
    Series.sort_values : Similar method for a Series.

    Examples
    --------
    >>> df = pd.DataFrame({
    ...     'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    ...     'col2': [2, 1, 9, 8, 7, 4],
    ...     'col3': [0, 1, 9, 4, 2, 3],
    ...     'col4': ['a', 'B', 'c', 'D', 'e', 'F']
    ... })
    >>> df
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

    Sort by col1

    >>> df.sort_values(by=['col1'])
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort by multiple columns

    >>> df.sort_values(by=['col1', 'col2'])
      col1  col2  col3 col4
    1    A     1     1    B
    0    A     2     0    a
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort Descending

    >>> df.sort_values(by='col1', ascending=False)
      col1  col2  col3 col4
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B
    3  NaN     8     4    D

    Putting NAs first

    >>> df.sort_values(by='col1', ascending=False, na_position='first')
      col1  col2  col3 col4
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B

    Sorting with a key function

    >>> df.sort_values(by='col4', key=lambda col: col.str.lower())
       col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

In [40]:
df.sort_values(by='Points',ascending =False)

    Points  Rank    Team  Year
0      876     1  Riders  2014
2      863     2  Devils  2014
5      812     4   Kings  2015
10     804     1  Royals  2015
1      789     2  Riders  2015
7      788     1   Kings  2017
6      756     1   Kings  2016
4      741     3   Kings  2014
9      701     4  Royals  2014
8      694     2  Riders  2016
11     690     2  Riders  2017
3      673     3  Devils  2015

In [44]:
#gives first rows from dataframe #default it gives 5 values
df.head(5)

   Points  Rank    Team  Year
0     876     1  Riders  2014
1     789     2  Riders  2015
2     863     2  Devils  2014
3     673     3  Devils  2015
4     741     3   Kings  2014

In [46]:
#gives last rows from dataframe #default it gives 5 values
df.tail(2)

    Points  Rank    Team  Year
10     804     1  Royals  2015
11     690     2  Riders  2017

In [50]:
#frequency /occurance of values
df["Rank"].value_counts()

2    4
1    4
4    2
3    2
Name: Rank, dtype: int64

## Missing Values

In [62]:
df=pd.read_csv("data.csv")
df

   Roll_no  Name division  marks
0        1  alex      NaN   15.0
1        2   NaN        B    NaN
2        3   max        A   10.0
3        4   NaN        B   11.0
4        5  rose        A    NaN

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Roll_no   5 non-null      int64
 1   Name      3 non-null      object
 2   division  4 non-null      object
 3   marks     3 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 288.0+ bytes

In [56]:
df.isnull().sum()

Roll_no     0
Name        2
division    1
marks       2
dtype: int64

#### 1. Remove all rows that contains NaN

In [60]:
df.dropna(inplace=True)

#### 2.Replace the NaN values mean,median,mode

In [64]:
#df.fillna(value)

df.fillna(1)

   Roll_no  Name division  marks
0        1  alex        1   15.0
1        2     1        B    1.0
2        3   max        A   10.0
3        4     1        B   11.0
4        5  rose        A    1.0

In [65]:
df["marks"]=df["marks"].fillna(df["marks"].mean())

In [66]:
df

   Roll_no  Name division  marks
0        1  alex      NaN   15.0
1        2   NaN        B   12.0
2        3   max        A   10.0
3        4   NaN        B   11.0
4        5  rose        A   12.0

In [70]:
md=df["division"].mode()[0]
df["division"]=df["division"].fillna(md)
df["Name"]=df["Name"].fillna("U")

In [71]:
df

   Roll_no  Name division  marks
0        1  alex        A   15.0
1        2     U        B   12.0
2        3   max        A   10.0
3        4     U        B   11.0
4        5  rose        A   12.0

### Forward Fill and Backword Fill

In [73]:
df=pd.read_csv("data.csv")
df

   Roll_no  Name division  marks
0        1  alex      NaN   15.0
1        2   NaN        B    NaN
2        3   max        A   10.0
3        4   NaN        B   11.0
4        5  rose        A    NaN

In [74]:
#forward fill
df.fillna(method="pad")

   Roll_no  Name division  marks
0        1  alex      NaN   15.0
1        2  alex        B   15.0
2        3   max        A   10.0
3        4   max        B   11.0
4        5  rose        A   11.0

In [75]:
#backward fill -> bfill/backfill
df.fillna(method="bfill")

   Roll_no  Name division  marks
0        1  alex        B   15.0
1        2   max        B   10.0
2        3   max        A   10.0
3        4  rose        B   11.0
4        5  rose        A    NaN